In [38]:
import pandas as pd

In [39]:
df_2019_b = pd.read_excel("./newBirth.xlsx", sheet_name="2019").sort_values("state")
df_2015_b = pd.read_excel("./newBirth.xlsx", sheet_name="2015").sort_values("state")
df_2005_b = pd.read_excel("./newBirth.xlsx", sheet_name="2005").sort_values("state")
df_1998_b = pd.read_excel("./newBirth.xlsx", sheet_name="1998").sort_values("state")
df_1992_b = pd.read_excel("./newBirth.xlsx", sheet_name="1992").sort_values("state")

In [40]:
df_1992_b.head()

               state   1992
0      andhrapradesh  11517
23  arunachalpradesh   2728
1              assam  10409
2              bihar  19072
22             delhi   9869

In [41]:
df_b_combined=df_2019_b.merge(df_2015_b, on="state", how="inner")
df_b_combined = df_b_combined.merge(df_2005_b, on="state", how="inner")
df_b_combined = df_b_combined.merge(df_1998_b, on="state", how="inner")
df_b_combined = df_b_combined.merge(df_1992_b, on="state", how="inner")
df_b_combined = df_b_combined.reset_index(drop=True)
df_b_combined.head()

              state   2019    2015   2005   1998   1992
0     andhrapradesh  18538   18311  13669  10933  11517
1  arunachalpradesh  33319   26936   3833   3219   2728
2             assam  57933   51952   7532   9893  10409
3             bihar  97677  109109  10448  23056  19072
4             delhi  17215    9281   6484   6837   9869

In [42]:
df_b_combined.to_excel("data_birth_combined.xlsx", index=False)

In [43]:
df_2019_d = pd.read_excel("./data_death.xlsx", sheet_name="2019").sort_values("state")
df_2015_d = pd.read_excel("./data_death.xlsx", sheet_name="2015").sort_values("state")
df_2005_d = pd.read_excel("./data_death.xlsx", sheet_name="2005").sort_values("state")
df_1998_d = pd.read_excel("./data_death.xlsx", sheet_name="1998").sort_values("state")
df_1992_d = pd.read_excel("./data_death.xlsx", sheet_name="1992").sort_values("state")

In [44]:
df_d_combined=df_2019_d.merge(df_2015_d, on="state", how="inner")
df_d_combined = df_d_combined.merge(df_2005_d, on="state", how="inner")
df_d_combined = df_d_combined.merge(df_1998_d, on="state", how="inner")
df_d_combined = df_d_combined.merge(df_1992_d, on="state", how="inner")
df_d_combined = df_d_combined.reset_index(drop=True)
df_d_combined.head()

              state  2019  2015  2005  1998  1992
0     andhrapradesh   663   735   547   671   664
1  arunachalpradesh   236   330   155    87    92
2             assam  1414  1876   417   353   638
3             bihar  4033  4486   547  1192  1069
4             delhi   350   211   242   223   389

In [45]:
df_d_combined.to_excel("data_death_combined.xlsx", index=False)